; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image4 - mode
	image3 - mode
	spectrograph2 - mode
	image0 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star2 - direction
	GroundStation3 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared1)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star4)
	(supports instrument3 image3)
	(supports instrument3 image4)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument4 image3)
	(supports instrument4 image4)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 image4)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
)
(:goal (and
	(pointing satellite1 Star2)
	(have_image Star5 image4)
	(have_image Star6 spectrograph2)
	(have_image Star7 infrared1)
	(have_image Planet8 image4)
	(have_image Phenomenon9 spectrograph2)
	(have_image Planet10 image3)
	(have_image Phenomenon11 infrared1)
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 infrared1)
	(have_image Planet14 infrared1)
))

)

; plan
1. (turn_to satellite1 star4 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star4)
   goals met: 0 of 11
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 11
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 11
4. (turn_to satellite1 phenomenon9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 11
5. (take_image satellite1 phenomenon9 instrument2 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 1 of 11
6. (turn_to satellite1 phenomenon12 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 11
7. (take_image satellite1 phenomenon12 instrument2 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 2 of 11
8. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 11
9. (turn_to satellite0 groundstation3 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 11
10. (take_image satellite1 phenomenon11 instrument2 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 3 of 11
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 11
12. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 3 of 11
13. (turn_to satellite0 planet10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet10)
   goals met: 3 of 11
14. (take_image satellite0 planet10 instrument0 image3)
   added: (have_image planet10 image3)
   goals met: 4 of 11
15. (turn_to satellite0 planet13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet13)
   goals met: 4 of 11
16. (take_image satellite0 planet13 instrument0 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 5 of 11
17. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 5 of 11
18. (take_image satellite0 planet14 instrument0 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 6 of 11
19. (turn_to satellite0 planet8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet8)
   goals met: 6 of 11
20. (take_image satellite0 planet8 instrument0 image4)
   added: (have_image planet8 image4)
   goals met: 7 of 11
21. (turn_to satellite0 star5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star5)
   goals met: 7 of 11
22. (take_image satellite0 star5 instrument0 image4)
   added: (have_image star5 image4)
   goals met: 8 of 11
23. (turn_to satellite0 star7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star7)
   goals met: 8 of 11
24. (take_image satellite0 star7 instrument0 infrared1)
   added: (have_image star7 infrared1)
   goals met: 9 of 11
25. (turn_to satellite1 star6 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star6)
   goals met: 9 of 11
26. (take_image satellite1 star6 instrument2 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 10 of 11
27. (turn_to satellite1 star2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star2)
   goals met: 11 of 11
